Revit 2024 API
BuiltInFailures.ExtrusionFailures Class
 Failures about Extrusions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ExtrusionFailures
Visual Basic
Public NotInheritable Class ExtrusionFailures
Visual C++
public ref class ExtrusionFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures
See Also
BuiltInFailures.ExtrusionFailures Members
Autodesk.Revit.DB Namespace